zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/middleware/wireless/framework_5.3.2/XCVR/MKW41Z4/fsl_xcvr_common_config.c
    .tsm_timing_00_init =       B3(END_OF_RX_WD) | B2(0x00) | B1(END_OF_TX_WD) | B0(0x00), /* bb_ldo_hf_en */
    .tsm_timing_01_init =       B3(END_OF_RX_WD) | B2(0x00) | B1(END_OF_TX_WD) | B0(0x00), /* bb_ldo_adcdac_en */
    .tsm_timing_02_init =       B3(END_OF_RX_WD) | B2(0x00) | B1(0xFF) |           B0(0xFF), /* bb_ldo_bba_en */
    .tsm_timing_03_init =       B3(END_OF_RX_WD) | B2(0x00) | B1(END_OF_TX_WD) | B0(0x00), /* bb_ldo_pd_en */
    .tsm_timing_04_init =       B3(END_OF_RX_WD) | B2(0x00) | B1(END_OF_TX_WD) | B0(0x00), /* bb_ldo_fdbk_en */
    .tsm_timing_05_init =       B3(END_OF_RX_WD) | B2(0x00) | B1(END_OF_TX_WD) | B0(0x00), /* bb_ldo_vcolo_en */
    .tsm_timing_06_init =       B3(END_OF_RX_WD) | B2(0x00) | B1(END_OF_TX_WD) | B0(0x00), /* bb_ldo_vtref_en */
    .tsm_timing_07_init =       B3(0x05) |       B2(0x00) | B1(0x05) |         B0(0x00), /* bb_ldo_fdbk_bleed_en */
    .tsm_timing_08_init =       B3(0x03) |       B2(0x00) | B1(0x03) |         B0(0x00), /* bb_ldo_vcolo_bleed_en */
    .tsm_timing_09_init =       B3(0x03) |       B2(0x00) | B1(0x03) |         B0(0x00), /* bb_ldo_vcolo_fastcharge_en */
    
    .tsm_timing_10_init =       B3(END_OF_RX_WD) | B2(0x03+AUX_PLL_DELAY) | B1(END_OF_TX_WD) | B0(0x03), /* bb_xtal_pll_ref_clk_en */
    .tsm_timing_11_init =       B3(0xFF) |       B2(0xFF) | B1(END_OF_TX_WD) | B0(0x03), /* bb_xtal_dac_ref_clk_en */
    .tsm_timing_12_init =       B3(END_OF_RX_WD) | B2(0x03+AUX_PLL_DELAY) | B1(0xFF) |           B0(0xFF), /* rxtx_auxpll_vco_ref_clk_en */
    .tsm_timing_13_init =       B3(0x18) |       B2(0x00) | B1(0x4C) |         B0(0x00), /* sy_vco_autotune_en */
    .tsm_timing_14_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x31+ADD_FOR_26MHZ) | B1(END_OF_TX_WU+PD_CYCLE_SLIP_TX_LO_ADJ) | B0(0x63+PD_CYCLE_SLIP_TX_HI_ADJ), /* sy_pd_cycle_slip_ld_ft_en */
    .tsm_timing_14_init_32mhz = B3(END_OF_RX_WD) | B2(0x31+AUX_PLL_DELAY) | B1(END_OF_TX_WU+PD_CYCLE_SLIP_TX_LO_ADJ) | B0(0x63+PD_CYCLE_SLIP_TX_HI_ADJ),
    .tsm_timing_15_init =       B3(END_OF_RX_WD) | B2(0x03+AUX_PLL_DELAY) | B1(END_OF_TX_WD) | B0(0x03), /* sy_vco_en */
    .tsm_timing_16_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x1C+ADD_FOR_26MHZ) | B1(0xFF) | B0(0xFF), /* sy_lo_rx_buf_en */
    .tsm_timing_16_init_32mhz = B3(END_OF_RX_WD) | B2(0x1C+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_17_init =       B3(0xFF) |       B2(0xFF) | B1(END_OF_TX_WD) | B0(0x55), /* sy_lo_tx_buf_en */
    .tsm_timing_18_init =       B3(END_OF_RX_WD) | B2(0x05+AUX_PLL_DELAY) | B1(END_OF_TX_WD) | B0(0x05), /* sy_divn_en */
    .tsm_timing_19_init =       B3(0x18+AUX_PLL_DELAY) |       B2(0x03+AUX_PLL_DELAY) | B1(0x4C) |         B0(0x03), /* sy_pd_filter_charge_en */
    
    .tsm_timing_20_init =       B3(END_OF_RX_WD) | B2(0x03+AUX_PLL_DELAY) | B1(END_OF_TX_WD) | B0(0x03), /* sy_pd_en */
    .tsm_timing_21_init =       B3(END_OF_RX_WD) | B2(0x04+AUX_PLL_DELAY) | B1(END_OF_TX_WD) | B0(0x04), /* sy_lo_divn_en */
    .tsm_timing_22_init =       B3(END_OF_RX_WD) | B2(0x04+AUX_PLL_DELAY) | B1(0xFF) |           B0(0xFF), /* sy_lo_rx_en */
    .tsm_timing_23_init =       B3(0xFF) |       B2(0xFF) | B1(END_OF_TX_WD) | B0(0x04), /*sy_lo_tx_en  */
    .tsm_timing_24_init =       B3(0x18) |       B2(0x00) | B1(0x4C) |         B0(0x00), /* sy_divn_cal_en */
    .tsm_timing_25_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x1D+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_lna_mixer_en */
    .tsm_timing_25_init_32mhz = B3(END_OF_RX_WD) | B2(0x1D+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_26_init =       B3(0xFF) |       B2(0xFF) | B1(END_OF_TX_WD) | B0(0x58), /* tx_pa_en */
    .tsm_timing_27_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x20+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_adc_i_q_en */
    .tsm_timing_27_init_32mhz = B3(END_OF_RX_WD) | B2(0x20+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_28_init_26mhz = B3(0x21+ADD_FOR_26MHZ) | B2(0x20+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_adc_reset_en */
    .tsm_timing_28_init_32mhz = B3(0x21+AUX_PLL_DELAY) | B2(0x20+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_29_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x1E + ADD_FOR_26MHZ + AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_bba_i_q_en */
    .tsm_timing_29_init_32mhz = B3(END_OF_RX_WD) | B2(0x1E + AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    
    .tsm_timing_30_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x20+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_bba_pdet_en */
    .tsm_timing_30_init_32mhz = B3(END_OF_RX_WD) | B2(0x20+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_31_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x1F+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_bba_tza_dcoc_en */
    .tsm_timing_31_init_32mhz = B3(END_OF_RX_WD) | B2(0x1F+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_32_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x1D+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_tza_i_q_en */
    .tsm_timing_32_init_32mhz = B3(END_OF_RX_WD) | B2(0x1D+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_33_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x20+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_tza_pdet_en */
    .tsm_timing_33_init_32mhz = B3(END_OF_RX_WD) | B2(0x20+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_34_init =       B3(END_OF_RX_WD) | B2(0x07+AUX_PLL_DELAY) | B1(END_OF_TX_WD) | B0(0x07), /* pll_dig_en */
    .tsm_timing_35_init =       B3(0xFF) |       B2(0xFF) | B1(END_OF_TX_WD), /* tx_dig_en - Byte 0 comes from mode specific settings */
    .tsm_timing_36_init_26mhz = B3(END_OF_RX_WD) | B2(0x66+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_dig_en */
    .tsm_timing_36_init_32mhz = B3(END_OF_RX_WD) | B2(0x66+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_37_init_26mhz = B3(0x67+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B2(0x66+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_init */
    .tsm_timing_37_init_32mhz = B3(0x67+AUX_PLL_DELAY) | B2(0x66+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_38_init =       B3(END_OF_RX_WD) | B2(0x0E + AUX_PLL_DELAY) | B1(END_OF_TX_WD) | B0(0x42), /* sigma_delta_en */
    .tsm_timing_39_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x66+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rx_phy_en */
    .tsm_timing_39_init_32mhz = B3(END_OF_RX_WD) | B2(0x66+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    
    .tsm_timing_40_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x26+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* dcoc_en */
    .tsm_timing_40_init_32mhz = B3(END_OF_RX_WD) | B2(0x26+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_41_init_26mhz = B3(0x27+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B2(0x26+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* dcoc_init */
    .tsm_timing_41_init_32mhz = B3(0x27+AUX_PLL_DELAY) | B2(0x26+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_51_init =       B3(END_OF_RX_WD) | B2(0x03+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rxtx_auxpll_bias_en */
    .tsm_timing_52_init_26mhz = B3(0x17+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B2(0x06+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rxtx_auxpll_fcal_en */
    .tsm_timing_52_init_32mhz = B3(0x17+AUX_PLL_DELAY) | B2(0x06+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_53_init =       B3(END_OF_RX_WD) | B2(0x03+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rxtx_auxpll_lf_pd_en */
    .tsm_timing_54_init_26mhz = B3(0x17+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B2(0x03+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rxtx_auxpll_pd_lf_filter_charge_en */
    .tsm_timing_54_init_32mhz = B3(0x17+AUX_PLL_DELAY) | B2(0x03+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_55_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x20+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rxtx_auxpll_adc_buf_en */
    .tsm_timing_55_init_32mhz = B3(END_OF_RX_WD) | B2(0x20+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_56_init_26mhz = B3(END_OF_RX_WD_26MHZ) | B2(0x20+ADD_FOR_26MHZ+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /* rxtx_auxpll_dig_buf_en */
    .tsm_timing_56_init_32mhz = B3(END_OF_RX_WD) | B2(0x20+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF),
    .tsm_timing_57_init =       B3(0x1A+AUX_PLL_DELAY) | B2(0x03+AUX_PLL_DELAY) | B1(0xFF) | B0(0xFF), /*rxtx_rccal_en  */
    .tsm_timing_58_init =       B3(0xFF) | B2(0xFF) | B1(END_OF_TX_WD) | B0(0x03), /* tx_hpm_dac_en */

    /* XCVR_TX_DIG configs */
#define radio_dft_mode 0
#define lfsr_length 4
#define lfsr_en 0
#define dft_clk_sel 4
#define tx_dft_en 0
#define soc_test_sel 0
#define tx_capture_pol 0
#define freq_word_adj 0
#define lrm 0
#define data_padding_pat_1 0x55
#define data_padding_pat_0 0xAA
#define gfsk_multiply_table_manual 0
#define gfsk_mi 1
#define gfsk_mld 0
#define gfsk_fld 0
#define gfsk_mod_index_scaling 0
#define tx_image_filter_ovrd_en 0
#define tx_image_filter_0_ovrd 0
#define tx_image_filter_1_ovrd 0
#define tx_image_filter_2_ovrd 0
#define gfsk_filter_coeff_manual2 0xC0630401
#define gfsk_filter_coeff_manual1 0xBB29960D
#define fsk_modulation_scale_0 0x1800
#define fsk_modulation_scale_1 0x0800
#define dft_mod_patternval 0
#define ctune_bist_go 0
#define ctune_bist_thrshld 0
#define pa_am_mod_freq 0
#define pa_am_mod_entries 0
#define pa_am_mod_en 0
#define syn_bist_go 0
#define syn_bist_all_channels 0
#define freq_count_threshold 0
#define hpm_inl_bist_go 0
#define hpm_dnl_bist_go 0
#define dft_max_ram_size 0

