zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/middleware/wireless/framework_5.3.2/XCVR/MKW41Z4/fsl_xcvr_common_config.c
  .tx_ctrl  =
    XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(radio_dft_mode) |
    XCVR_TX_DIG_CTRL_LFSR_LENGTH(lfsr_length)       |
    XCVR_TX_DIG_CTRL_LFSR_EN(lfsr_en)               |
    XCVR_TX_DIG_CTRL_DFT_CLK_SEL(dft_clk_sel)       |
    XCVR_TX_DIG_CTRL_TX_DFT_EN(tx_dft_en)           |
    XCVR_TX_DIG_CTRL_SOC_TEST_SEL(soc_test_sel)     |
    XCVR_TX_DIG_CTRL_TX_CAPTURE_POL(tx_capture_pol) |
    XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ(freq_word_adj),
/*-------------------------------------------------------------------------------------------------*/
  .tx_data_padding  =
    XCVR_TX_DIG_DATA_PADDING_LRM(lrm)                               |
    XCVR_TX_DIG_DATA_PADDING_DATA_PADDING_PAT_1(data_padding_pat_1) |
    XCVR_TX_DIG_DATA_PADDING_DATA_PADDING_PAT_0(data_padding_pat_0),
/*-------------------------------------------------------------------------------------------------*/
  .tx_dft_pattern  =
    XCVR_TX_DIG_DFT_PATTERN_DFT_MOD_PATTERN(dft_mod_patternval),
/*-------------------------------------------------------------------------------------------------*/
  .rf_dft_bist_1  =
    XCVR_TX_DIG_RF_DFT_BIST_1_CTUNE_BIST_GO(ctune_bist_go)           |
    XCVR_TX_DIG_RF_DFT_BIST_1_CTUNE_BIST_THRSHLD(ctune_bist_thrshld) |
    XCVR_TX_DIG_RF_DFT_BIST_1_PA_AM_MOD_FREQ(pa_am_mod_freq)         |
    XCVR_TX_DIG_RF_DFT_BIST_1_PA_AM_MOD_ENTRIES(pa_am_mod_entries)   |
    XCVR_TX_DIG_RF_DFT_BIST_1_PA_AM_MOD_EN(pa_am_mod_en),
/*-------------------------------------------------------------------------------------------------*/
  .rf_dft_bist_2  =
    XCVR_TX_DIG_RF_DFT_BIST_2_SYN_BIST_GO(syn_bist_go)                     |
    XCVR_TX_DIG_RF_DFT_BIST_2_SYN_BIST_ALL_CHANNELS(syn_bist_all_channels) |
    XCVR_TX_DIG_RF_DFT_BIST_2_FREQ_COUNT_THRESHOLD(freq_count_threshold)   |
    XCVR_TX_DIG_RF_DFT_BIST_2_HPM_INL_BIST_GO(hpm_inl_bist_go)             |
    XCVR_TX_DIG_RF_DFT_BIST_2_HPM_DNL_BIST_GO(hpm_dnl_bist_go)             |
    XCVR_TX_DIG_RF_DFT_BIST_2_DFT_MAX_RAM_SIZE(dft_max_ram_size),
};
